surfaceWater/runCases/RANS_2D/MeshSelection4/3mmx0.5mm/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1056
(
(0.0174715 0.00276737 2.07656e-25)
(0.0234599 0.00340177 4.70659e-26)
(0.0331414 0.0041892 -3.7697e-22)
(0.0392891 0.00412261 9.42318e-24)
(0.0400319 0.00407064 9.27277e-24)
(0.0454791 0.00365103 1.81054e-22)
(0.0516784 0.00315538 0)
(0.0531486 0.00305531 0)
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    bottom
    {
        type            noSlip;
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<vector> 
32
(
(0.00847064 0.00148773 9.21264e-25)
(0.0219018 0.00306437 -1.84535e-20)
(0.0293233 0.00323583 8.67499e-21)
(0.0346195 0.00291089 -1.63034e-25)
(0.0346195 0.00291089 -1.63034e-25)
(0.0401046 0.00230815 0)
(0.0469073 0.00164378 0)
(0.0469073 0.00164378 0)
...
)
;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<vector> 
32
(
(0.00847064 0.00148773 9.21264e-25)
(0.0219018 0.00306437 -1.84535e-20)
(0.0293233 0.00323583 8.67499e-21)
(0.0346195 0.00291089 -1.63034e-25)
(0.0346195 0.00291089 -1.63034e-25)
(0.0401046 0.00230815 0)
(0.0469073 0.00164378 0)
(0.0469073 0.00164378 0)
...
)
;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
