surfaceWater/runCases/RANS_2D/MeshSelection4/3mmx0.5mm/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1056
(
3.43688e-05
9.45264e-05
0.000205586
0.000318137
0.0003314
0.000409567
0.000464152
0.000472846
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    bottom
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
33
(
3.08239e-06
3.08239e-06
3.39649e-06
3.72448e-06
3.72448e-06
3.60552e-06
3.60552e-06
3.37706e-06
...
)
;
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
3.36152e-06
8.19991e-05
0.000240145
0.000349228
0.000349228
0.000429881
0.000488512
0.000488512
...
)
;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
3.36152e-06
8.19991e-05
0.000240145
0.000349228
0.000349228
0.000429881
0.000488512
0.000488512
...
)
;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
