surfaceWater/runCases/RANS_2D/MeshSelection4/3mmx0.5mm/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1056
(
2.33142e-07
1.57165e-06
5.44284e-06
1.17202e-05
1.27957e-05
1.95188e-05
2.41188e-05
2.46919e-05
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    bottom
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    right
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
3.7285e-09
5.98433e-07
5.28247e-06
1.3307e-05
1.3307e-05
2.08859e-05
2.59489e-05
2.59489e-05
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
33
(
0.000138079
0.000138079
0.00013811
0.000138138
0.000138138
0.000138162
0.000138162
0.000138185
...
)
;
    }
    left
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
32
(
3.7285e-09
5.98433e-07
5.28247e-06
1.3307e-05
1.3307e-05
2.08859e-05
2.59489e-05
2.59489e-05
...
)
;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
